src/cf/InformationRegisters/ИсторияРезервногоКопированияВстроенногоХранилищаДвоичныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРезервногоКопированияВстроенногоХранилищаДвоичныхДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайлаРезервнойКопии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРезервнойКопии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРезервныхКопийВстроенногоХранилищаДвоичныхДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияРезервногоКопированияВстроенногоХранилищаДвоичныхДанных/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
Процедура ДобавитьЗапись(ВидРезервнойКопии, ДатаСоздания, ИмяФайлаРезервнойКопии) Экспорт

	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ВидРезервнойКопии.Установить(ВидРезервнойКопии);
	Набор.Отбор.ДатаСоздания.Установить(ДатаСоздания);

	Запись = Набор.Добавить();
	Запись.ВидРезервнойКопии		= ВидРезервнойКопии;
	Запись.ДатаСоздания				= ДатаСоздания;
	Запись.ИмяФайлаРезервнойКопии	= ИмяФайлаРезервнойКопии;

	Набор.Записать();

КонецПроцедуры
#КонецОбласти

#КонецЕсли
